# 三百六十、公司-2018 春招笔试-Android 开发工程师客观题合集

## 1

下列说法中正确的是（      ）

正确答案: A   你的答案: 空 (错误)

```cpp
冒泡排序法的平均时间复杂度为 O(n²)
```

```cpp
二分法的平均时间复杂度度是 O（n）
```

```cpp
m 个并列循环的时间复杂度为 O（mn）
```

```cpp
快速排序法的时间复杂度一定优于冒泡排序法
```

本题知识点

安卓工程师 360 公司 复杂度 排序 *安卓工程师 360 公司 2018* *讨论

[learner111111](https://www.nowcoder.com/profile/970262031)

这套题所有的多选题都被当成单选题来看了。。。无语。

发表于 2018-12-24 17:56:42

* * *

## 2

关键字序列为{12，11，19，23，1，6，10},哈希函数为 H(key)=key MOD 11,用链地址法构造哈希表,哈希地址为 1 的链中有（      ）个记录（      ）

正确答案: D   你的答案: 空 (错误)

```cpp
7
```

```cpp
5
```

```cpp
4
```

```cpp
3
```

本题知识点

安卓工程师 360 公司 哈希 *安卓工程师 360 公司 2018* *## 3

下面关于动态规划说法正确的是

正确答案: A   你的答案: 空 (错误)

```cpp
他是利用子结构，进行自底而上的算法设计
```

```cpp
他需要后来多次计算的问题进行缓存，减少重复子问题的计算
```

```cpp
他所求问题的整体最优解可以通过一系列局部最优的选择
```

```cpp
他将分解后的子问题看成相互独立的.
```

本题知识点

安卓工程师 360 公司 动态规划 安卓工程师 360 公司 2018

## 4

下列关于排序算法的描述错误的是

正确答案: B   你的答案: 空 (错误)

```cpp
在待排序的记录集中，存在多个具有相同键值的记录，若经过排序，这些记录的相对次序仍然保持不变，称这种排序为稳定排序
```

```cpp
二叉查找树的查找效率与二叉树的树型有关，在节点太复杂时其查找效率最低
```

```cpp
下列排序算法中，希尔排序在某趟排序结束后不一定能选出一个元素放到其最终位置上。
```

```cpp
在下列排序方法中,插入排序方法可能出现这种情况:在最后一趟开始之前,所有的元素都不在其最终应在的正确位置上
```

本题知识点

安卓工程师 360 公司 排序 *安卓工程师 360 公司 2018* *讨论

[刘飞 201810171050636](https://www.nowcoder.com/profile/354407947)

当先后插入关键字有序排列时，生成的二叉排序树蜕变为单支树，树的深度为 n,平均查找长度 ASL＝(n+1)/2 所以，节点简单时，查找效率低

发表于 2019-10-04 08:27:04

* * *

## 5

请指出以下代码段使用了何种算法

```cpp
public void func(int[] arr1, int k, int m,int[] arr2) { 
arr2[0] = 0; 
for (int i = 1; i <= m; i++) { 
int min = i; 

[我的天鸭](https://www.nowcoder.com/profile/243498)

```cpp
class Empty{
public:
    Empty(); // 缺省构造函数//
    Empty( const Empty& ); // 拷贝构造函数//
    ~Empty(); // 析构函数//
    Empty& operator=( const Empty& ); // 赋值运算符//
    Empty* operator&(); // 取址运算符
    const Empty* operator&() const; // 取址运算符 const
};

```

只有在需要的时候才会生成以上六种成员函数

发表于 2019-08-17 12:43:59

* * *

## 43

变量 void (*s[5])(int)表示意思为（）

正确答案: B   你的答案: 空 (错误)

```cpp
函数指针
```

```cpp
函数指针数组
```

```cpp
数组指针函数
```

```cpp
语法错误
```

本题知识点

安卓工程师 360 公司 C++ 2018 C 语言

讨论

[MyDearestT.K.](https://www.nowcoder.com/profile/633229196)

这是一个标准的函数指针数组，s 先与[5]结合，说明 s 是一个数组，数组的内容是 void (*)(int)类型的函数指针，该指针指向的函数参数为 int，返回值为 void。

编辑于 2019-08-16 10:58:18

* * *

[Huth](https://www.nowcoder.com/profile/46375113)

先把数组声明[5]去掉来看，就是一个函数指针。再加上[5]，就是 5 个函数指针，5 个就是数组了，所以是函数指针数组

发表于 2020-02-24 22:21:01

* * *

[—永恒 N 守护](https://www.nowcoder.com/profile/213052882)

void (*s[5])(int)可以看做先*s[5]为指针数组再看 void (int)是一个函数加起来就是指针数组函数

发表于 2019-12-28 09:23:54

* * *

## 44

定义宏#define DECLARE(name, type) type name##_##type##_type，
则 DECLARE(val, int)替换结果为（）

正确答案: A   你的答案: 空 (错误)

```cpp
int val_int_type
```

```cpp
int val_int_int
```

```cpp
int name_int_int
```

```cpp
int name_int_name
```

本题知识点

安卓工程师 360 公司 C++ 安卓工程师 360 公司 2018

讨论

[我的天鸭](https://www.nowcoder.com/profile/243498)

##是一种分隔连接方式，它的作用是**先分隔，然后进行强制连接**“name”和第一个“_”之间被分隔了，所以预处理器会把 name##_##type##_type 解释成 4 段：“**name**”、“_”、“**type**”以及“**_type**”，name 和 type 会被替换，而 _type 不会被替换

编辑于 2019-08-17 14:14:52

* * *

[菜鸡准备转岗](https://www.nowcoder.com/profile/836159636)

懵逼。。。

发表于 2019-08-16 15:44:28

* * *

## 45

extern "c"的作用有哪些（）

正确答案: A   你的答案: 空 (错误)

```cpp
实现 C++代码调用其他 C 语言代码
```

```cpp
使 C 函数不被 C++编译器优化
```

```cpp
使 C 函数使用 C 编译器优化
```

```cpp
到出 C 变量或函数
```

本题知识点

安卓工程师 360 公司 C++ 安卓工程师 360 公司 2018

讨论

[云岫﹏](https://www.nowcoder.com/profile/539356673)

参考博主的博文[`blog.csdn.net/qq_30891813/article/details/87631651`](https://blog.csdn.net/qq_30891813/article/details/87631651)

发表于 2019-08-28 16:36:50

* * *

## 46

下面程序打印结果为（）

```cpp
#include<iostream>
using namespace std;

class A
{
char a[3];
public:
virtual void fun1(){};
};

class B : public virtual A
{
char b[3];
public:
virtual void fun2(){};
};

class C : public virtual B
{
char c[3];
public:
virtual void fun3(){};
};

int main ()
{
cout << sizeof(A) << endl;
cout << sizeof(B) << endl;
cout << sizeof(C) << endl;
return 0;
}
```

正确答案: B   你的答案: 空 (错误)

```cpp
4,20,28
```

```cpp
8,20,32
```

```cpp
4,12,20
```

```cpp
8,16,28
```

本题知识点

安卓工程师 360 公司 C++ 安卓工程师 360 公司 2018

讨论

[已注销](https://www.nowcoder.com/profile/824253375)

![](img/dd87fadc7ae25e941ff663198fde5775.png)

发表于 2019-09-16 19:33:42

* * *

[一生红蓝](https://www.nowcoder.com/profile/726024349)

在 Linux 系统下答案为 8 16 24![](img/28127dee89665139aa69016732741859.png)

发表于 2019-08-24 17:16:30

* * *

[我的天鸭](https://www.nowcoder.com/profile/243498)

这道题的答案是 VS 平台下的，打印出 A B C 三个类的布局如下：可以看出，**虚继承的时候 A B C 三个类不仅不会共享虚基类指针，也不会共享虚表指针**，要和普通继承区分开来

```cpp
1> class A size(8):
1>      +---
1> 0    | {vfptr}
1> 4    | a
1>      | <alignment member> (size=1)
1>      +---

1> class B size(20):
1>      +---
1> 0    | {vfptr}
1> 4    | {vbptr}
1> 8    | b
1>      | <alignment member> (size=1)
1>      +---
1>      +--- (virtual base A)
1>12    | {vfptr}
1>16    | a
1>      | <alignment member> (size=1)
1>      +---

1> class C size(32):
1>      +---
1> 0    | {vfptr}
1> 4    | {vbptr}
1> 8    | c
1>      | <alignment member> (size=1)
1>      +---
1>      +--- (virtual base A)
1>12    | {vfptr}
1>16    | a
1>      | <alignment member> (size=1)
1>      +---
1>      +--- (virtual base B)
1>20    | {vfptr}
1>24    | {vbptr}
1>28    | b
1>      | <alignment member> (size=1)
1>      +---
```

发表于 2019-08-15 22:18:11

* * *

## 47

下面代码打印结果为（）

```cpp
class Base {
char data[3];
public:
virtual void f() { cout << "Base::f" << endl; }
virtual void g() { cout << "Base::g" << endl; }
virtual void h() { cout << "Base::h" << endl; }

};
int main()
{
cout << sizeof(Base)<< endl;
return 0; 
}
```

正确答案: C   你的答案: 空 (错误)

```cpp
6
```

```cpp
7
```

```cpp
8
```

```cpp
9
```

本题知识点

安卓工程师 360 公司 C++ 安卓工程师 360 公司 2018

讨论

[不负韶光，野蛮生长](https://www.nowcoder.com/profile/367084618)

个人观点，char 数组占用了 3 个字节，虚函数有虚函数表要占 4 字节，无论多少个虚函数，都只要 4 字节，考虑对齐，差 char 那占 4 个，总共占 8 个

发表于 2019-08-22 14:47:51

* * *

