# 三百六十、公司-2018 春招笔试-iOS 开发工程师客观题合集

## 1

下列说法中正确的是（      ）

正确答案: A   你的答案: 空 (错误)

```cpp
冒泡排序法的平均时间复杂度为 O(n²)
```

```cpp
二分法的平均时间复杂度度是 O（n）
```

```cpp
m 个并列循环的时间复杂度为 O（mn）
```

```cpp
快速排序法的时间复杂度一定优于冒泡排序法
```

本题知识点

iOS 工程师 360 公司 排序 *iOS 工程师 360 公司 2018* *## 2

关键字序列为{12，11，19，23，1，6，10},哈希函数为 H(key)=key MOD 11,用链地址法构造哈希表,哈希地址为 1 的链中有（      ）个记录（      ）

正确答案: D   你的答案: 空 (错误)

```cpp
7
```

```cpp
5
```

```cpp
4
```

```cpp
3
```

本题知识点

iOS 工程师 360 公司 哈希 *iOS 工程师 360 公司 2018* *讨论

[等等芒果](https://www.nowcoder.com/profile/405078413)

12%11=1；11%11=0；19%11=8；23%11=1；1%11=1；6%11=6；10%11=10；哈希地址为 1 的链中有 12,23,1

发表于 2019-08-31 20:35:04

* * *

[天尊墨宇](https://www.nowcoder.com/profile/667959477)

选 D

发表于 2020-07-16 21:16:32

* * *

[是颗甜橙](https://www.nowcoder.com/profile/107950536)

10 的地址是 10 非 1

发表于 2019-10-24 01:07:03

* * *

## 3

下面关于动态规划说法正确的是

正确答案: A   你的答案: 空 (错误)

```cpp
他是利用子结构，进行自底而上的算法设计
```

```cpp
他需要后来多次计算的问题进行缓存，减少重复子问题的计算
```

```cpp
他所求问题的整体最优解可以通过一系列局部最优的选择
```

```cpp
他将分解后的子问题看成相互独立的.
```

本题知识点

iOS 工程师 360 公司 动态规划 iOS 工程师 360 公司 2018

## 4

下列关于排序算法的描述错误的是

正确答案: B   你的答案: 空 (错误)

```cpp
在待排序的记录集中，存在多个具有相同键值的记录，若经过排序，这些记录的相对次序仍然保持不变，称这种排序为稳定排序
```

```cpp
二叉查找树的查找效率与二叉树的树型有关，在节点太复杂时其查找效率最低
```

```cpp
下列排序算法中，希尔排序在某趟排序结束后不一定能选出一个元素放到其最终位置上。
```

```cpp
在下列排序方法中,插入排序方法可能出现这种情况:在最后一趟开始之前,所有的元素都不在其最终应在的正确位置上
```

本题知识点

iOS 工程师 360 公司 排序 *iOS 工程师 360 公司 2018* *## 5

请指出以下代码段使用了何种算法

```cpp
public void func(int[] arr1, int k, int m,int[] arr2) { 

函数表是在编译期就建立了,各个虚拟函数这时被组织成了一个虚拟函数的入口地址的数组.而对象的隐藏成员--虚拟函数表指针是在运行期--也就是构造函数被调用时进行初始化的,这是实现多态的关键

发表于 2019-08-26 22:45:57

* * *

## 67

C++中空类默认产生哪些类成员函数（）

正确答案: A B C D   你的答案: 空 (错误)

```cpp
默认构造函数
```

```cpp
析构函数
```

```cpp
拷贝构造函数
```

```cpp
赋值函数
```

本题知识点

iOS 工程师 360 公司 C++ iOS 工程师 360 公司 2018

讨论

[小白（c/c++）](https://www.nowcoder.com/profile/976313281)

不严谨

发表于 2019-08-28 13:41:11

* * *

## 68

变量 void (*s[5])(int)表示意思为（）

正确答案: B   你的答案: 空 (错误)

```cpp
函数指针
```

```cpp
函数指针数组
```

```cpp
数组指针函数
```

```cpp
语法错误
```

本题知识点

iOS 工程师 360 公司 C++ iOS 工程师 360 公司 2018

讨论

[BroWuG](https://www.nowcoder.com/profile/297231019)

函数指针 `void(*p)(int)`
函数指针数组 `void (*s[5])(int)`

发表于 2019-08-25 11:43:06

* * *

## 69

定义宏#define DECLARE(name, type) type name##_##type##_type，
则 DECLARE(val, int)替换结果为（）

正确答案: A   你的答案: 空 (错误)

```cpp
int val_int_type
```

```cpp
int val_int_int
```

```cpp
int name_int_int
```

```cpp
int name_int_name
```

本题知识点

iOS 工程师 360 公司 C++ iOS 工程师 360 公司 2018

讨论

[枭 1994](https://www.nowcoder.com/profile/248060421)

##是一种分隔连接方式，它的作用是**先分隔，然后进行强制连接**“name”和第一个“_”之间被分隔了，所以预处理器会把 name##_##type##_type 解释成 4 段：“**name**”、“_”、“**type**”以及“**_type**”，name 和 type 会被替换，而 _type 不会被替换

发表于 2019-10-04 16:25:11

* * *

[犇流](https://www.nowcoder.com/profile/139469194)

比较简单的方式丢编译器，然后得到疑问##，丢百度得出楼上结果，学习了。分隔符： **## 是一种分隔连接方式，它的作用是****先分隔，然后进行强制连接**但也要了解宏定义只是单纯的宏替换，注意必要的括号

发表于 2019-10-06 12:52:23

* * *

## 70

extern "c"的作用有哪些（）

正确答案: A   你的答案: 空 (错误)

```cpp
实现 C++代码调用其他 C 语言代码
```

```cpp
使 C 函数不被 C++编译器优化
```

```cpp
使 C 函数使用 C 编译器优化
```

```cpp
到出 C 变量或函数
```

本题知识点

iOS 工程师 360 公司 C++ iOS 工程师 360 公司 2018

讨论

[秋于得海](https://www.nowcoder.com/profile/211491612)

extern “C”指令中的 C，表示的一种编译和连接规约，而不是一种语言。C 表示符合 C 语言的编译和连接规约的任何语言，如 Fortran、assembler 等。 extern “C”指令仅指定编译和连接规约，但不影响语义。例如在函数声明中，指定了 extern “C”，仍然要遵守 C++的类型检测、参数转换规则。 extern “C”的真实目的是实现类 C 和 C++的混合编程。在 C++源文件中的语句前面加上 extern “C”，表明它按照类 C 的编译和连接规约来编译和连接，而不是 C++的编译的连接规约。这样在类 C 的代码中就可以调用 C++的函数 or 变量等。（注：我在这里所说的类 C，代表的是跟 C 语言的编译和连接方式一致的所有语言）

发表于 2019-08-30 10:40:37

* * *

## 71

在 32 位系统中，下面程序打印结果为（）
#include<iostream>
using namespace std;

class A
{
char a[3];
public:
virtual void fun1(){};
};

class B : public virtual A
{
char b[3];
public:
virtual void fun2(){};
};

class C : public virtual B
{
char c[3];
public:
virtual void fun3(){};
};

int main ()
{
cout << sizeof(A) << endl;
cout << sizeof(B) << endl;
cout << sizeof(C) << endl;
return 0;
}

正确答案: D   你的答案: 空 (错误)

```cpp
4,20,28
```

```cpp
8,20,32
```

```cpp
4,12,20
```

```cpp
8,16,24
```

本题知识点

iOS 工程师 360 公司 C++ iOS 工程师 360 公司 2018

讨论

[Tauruschill](https://www.nowcoder.com/profile/152468017)

不同编译器虚继承内存存取方式不同。GCC 共享虚函数表指针，结果为 D。VC 在虚继承下不共享父类虚函数表指针，结果为 B。

发表于 2019-10-14 12:34:28

* * *

[晨小白](https://www.nowcoder.com/profile/938331974)

![](img/1dc9eeec4d4bb1e0dce2a773a8666629.png)这是结果，果然这个答案是错误的，我的 vs 版本 2012

发表于 2019-09-14 00:11:15

* * *

[我的天鸭](https://www.nowcoder.com/profile/243498)

这道题的答案在 VS 平台下选 B，打印出 A B C 三个类的布局如下：可以看出，虚继承的时候 A B C 三个类不仅不会共享虚基类指针，也不会共享虚表指针，要和普通继承区分开来

```cpp
1> class A size(8):
1>      +---
1> 0    | {vfptr}
1> 4    | a
1>      | <alignment member> (size=1)
1>      +---

1> class B size(20):
1>      +---
1> 0    | {vfptr}
1> 4    | {vbptr}
1> 8    | b
1>      | <alignment member> (size=1)
1>      +---
1>      +--- (virtual base A)
1>12    | {vfptr}
1>16    | a
1>      | <alignment member> (size=1)
1>      +---

1> class C size(32):
1>      +---
1> 0    | {vfptr}
1> 4    | {vbptr}
1> 8    | c
1>      | <alignment member> (size=1)
1>      +---
1>      +--- (virtual base A)
1>12    | {vfptr}
1>16    | a
1>      | <alignment member> (size=1)
1>      +---
1>      +--- (virtual base B)
1>20    | {vfptr}
1>24    | {vbptr}
1>28    | b
1>      | <alignment member> (size=1)
1>      +---
```

编辑于 2019-08-21 16:01:15

* * *

## 72

下面代码打印结果为（）
class Base {
char data[3];
public:
virtual void f() { cout << "Base::f" << endl; }
virtual void g() { cout << "Base::g" << endl; }
virtual void h() { cout << "Base::h" << endl; }

};
int main()
{
cout << sizeof(Base)<< endl;
return 0;
}

正确答案: C   你的答案: 空 (错误)

```cpp
6
```

```cpp
7
```

```cpp
8
```

```cpp
9
```

本题知识点

iOS 工程师 360 公司 C++ iOS 工程师 360 公司 2018

讨论

[伽玛呦](https://www.nowcoder.com/profile/595847878)

char 数组 3 个，字节对齐加 1 个，虚函数表指针 4 个。加起来 8 个。

编辑于 2019-09-07 10:34:15

* * *

## 73

在 C 语言源程序的开始处通常加上预处理命令 #include   <stdio.h> 的原因是

正确答案: A   你的答案: 空 (错误)

